# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
from pyspark.sql import SparkSession
from pyspark.sql import functions as F
from pyspark.sql import types as T

spark = SparkSession.builder\
                    .appName('baby')\
                    .getOrCreate()

25/06/18 14:10:30 WARN Utils: Your hostname, kevin-llanos-Type1ProductConfigId resolves to a loopback address: 127.0.1.1; using 192.168.1.92 instead (on interface wlo1)
25/06/18 14:10:30 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/06/18 14:10:32 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
import requests
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

get_url = requests.get(url)

with open('data.csv', 'w', encoding='utf-8') as f:
    f.write(get_url.text)

### Step 3. Assign it to a variable called baby_names.

## üêç **Soluci√≥n Pyspark**

In [3]:
baby_names = spark.read.csv('data.csv', sep=',', header=True)

baby_names.show()

25/06/18 14:10:48 WARN GarbageCollectionMetrics: To enable non-built-in garbage collector(s) List(G1 Concurrent GC), users should configure it(them) to spark.eventLog.gcMetrics.youngGenerationGarbageCollectors or spark.eventLog.gcMetrics.oldGenerationGarbageCollectors

+-----+-----+---------+----+------+-----+-----+
|  _c0|   Id|     Name|Year|Gender|State|Count|
+-----+-----+---------+----+------+-----+-----+
|11349|11350|     Emma|2004|     F|   AK|   62|
|11350|11351|  Madison|2004|     F|   AK|   48|
|11351|11352|   Hannah|2004|     F|   AK|   46|
|11352|11353|    Grace|2004|     F|   AK|   44|
|11353|11354|    Emily|2004|     F|   AK|   41|
|11354|11355|  Abigail|2004|     F|   AK|   37|
|11355|11356|   Olivia|2004|     F|   AK|   33|
|11356|11357| Isabella|2004|     F|   AK|   30|
|11357|11358|   Alyssa|2004|     F|   AK|   29|
|11358|11359|   Sophia|2004|     F|   AK|   28|
|11359|11360|   Alexis|2004|     F|   AK|   27|
|11360|11361|Elizabeth|2004|     F|   AK|   27|
|11361|11362|   Hailey|2004|     F|   AK|   27|
|11362|11363|     Anna|2004|     F|   AK|   26|
|11363|11364|  Natalie|2004|     F|   AK|   25|
|11364|11365|    Sarah|2004|     F|   AK|   25|
|11365|11366|   Sydney|2004|     F|   AK|   25|
|11366|11367|      Ava|2004|     F|   AK|   23|
|11367|11368|  Trinity|2004|     F|   AK|   22|
|11368|11369|    Haley|2004|     F|   AK|   21|
+-----+-----+---------+----+------+-----+-----+
only showing top 20 rows

25/06/18 14:10:51 WARN CSVHeaderChecker: CSV header does not conform to the schema.
 Header: , Id, Name, Year, Gender, State, Count
 Schema: _c0, Id, Name, Year, Gender, State, Count
Expected: _c0 but found:
CSV file: file:///home/kevin-llanos/Proyectos/pyspark_exercises/06_Stats/US_Baby_Names/data.csv

In [4]:
df = pd.read_csv('data.csv')

df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

## üêç **Soluci√≥n Pyspark**

In [5]:
baby_names.show(10)

+-----+-----+--------+----+------+-----+-----+
|  _c0|   Id|    Name|Year|Gender|State|Count|
+-----+-----+--------+----+------+-----+-----+
|11349|11350|    Emma|2004|     F|   AK|   62|
|11350|11351| Madison|2004|     F|   AK|   48|
|11351|11352|  Hannah|2004|     F|   AK|   46|
|11352|11353|   Grace|2004|     F|   AK|   44|
|11353|11354|   Emily|2004|     F|   AK|   41|
|11354|11355| Abigail|2004|     F|   AK|   37|
|11355|11356|  Olivia|2004|     F|   AK|   33|
|11356|11357|Isabella|2004|     F|   AK|   30|
|11357|11358|  Alyssa|2004|     F|   AK|   29|
|11358|11359|  Sophia|2004|     F|   AK|   28|
+-----+-----+--------+----+------+-----+-----+
only showing top 10 rows

25/06/18 14:10:53 WARN CSVHeaderChecker: CSV header does not conform to the schema.
 Header: , Id, Name, Year, Gender, State, Count
 Schema: _c0, Id, Name, Year, Gender, State, Count
Expected: _c0 but found:
CSV file: file:///home/kevin-llanos/Proyectos/pyspark_exercises/06_Stats/US_Baby_Names/data.csv

In [6]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

## üêç **Soluci√≥n Pyspark**

In [7]:
baby_names.columns

['_c0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count']

In [8]:
baby_names = baby_names.drop('_c0')
baby_names = baby_names.drop('Id')

baby_names.show()

+---------+----+------+-----+-----+
|     Name|Year|Gender|State|Count|
+---------+----+------+-----+-----+
|     Emma|2004|     F|   AK|   62|
|  Madison|2004|     F|   AK|   48|
|   Hannah|2004|     F|   AK|   46|
|    Grace|2004|     F|   AK|   44|
|    Emily|2004|     F|   AK|   41|
|  Abigail|2004|     F|   AK|   37|
|   Olivia|2004|     F|   AK|   33|
| Isabella|2004|     F|   AK|   30|
|   Alyssa|2004|     F|   AK|   29|
|   Sophia|2004|     F|   AK|   28|
|   Alexis|2004|     F|   AK|   27|
|Elizabeth|2004|     F|   AK|   27|
|   Hailey|2004|     F|   AK|   27|
|     Anna|2004|     F|   AK|   26|
|  Natalie|2004|     F|   AK|   25|
|    Sarah|2004|     F|   AK|   25|
|   Sydney|2004|     F|   AK|   25|
|      Ava|2004|     F|   AK|   23|
|  Trinity|2004|     F|   AK|   22|
|    Haley|2004|     F|   AK|   21|
+---------+----+------+-----+-----+
only showing top 20 rows

In [9]:
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [10]:
df.drop(columns=['Unnamed: 0', 'Id'], inplace=True)

df

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

## üêç **Soluci√≥n Pyspark**

In [11]:
baby_names.groupBy(F.col('Gender')).count().show()

+------+------+
|Gender| count|
+------+------+
|     F|558846|
|     M|457549|
+------+------+

In [12]:
df['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

Existen m√°s mujeres en el dataset

### Step 7. Group the dataset by name and assign to names

## üêç **Soluci√≥n Pyspark**

In [13]:
baby_names.groupBy(F.col('name')).count().show()

+--------+-----+
|    name|count|
+--------+-----+
|   Kiana|  341|
|  Alayna|  469|
|   Ember|  262|
|   Tyler|  770|
|  Maddox|  537|
|  Kellen|  398|
|  Heaven|  403|
|Julianne|  257|
| Susanna|  151|
|  Kenlee|   76|
|    Kloe|  153|
|   Anyah|   68|
|   Tegan|  322|
| Jazzlyn|   96|
|Brileigh|   20|
|Analeigh|   57|
|Kamarion|  118|
|   Aryan|  212|
| Galilea|  119|
|    Faye|  126|
+--------+-----+
only showing top 20 rows

In [14]:
df['Name'].value_counts()

Name
Riley        1112
Avery        1080
Jordan       1073
Peyton       1064
Hayden       1049
             ...
Anaka           1
Montanna        1
Thaddaeus       1
Miroslav        1
Ackley          1
Name: count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

## üêç **Soluci√≥n Pyspark**

In [15]:
baby_names.select(F.countDistinct('Name').alias('total_nombre')).show()

+------------+
|total_nombre|
+------------+
|       17632|
+------------+

In [16]:
df['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

## üêç **Soluci√≥n Pyspark**

In [25]:
top_names = (baby_names
             .groupBy('Name')
             .agg(F.sum('Count').alias('total_births'))   # suma nacimientos
             .orderBy(F.desc('total_births')))

top_names.show(5)

+--------+------------+
|    Name|total_births|
+--------+------------+
|   Jacob|    242874.0|
|    Emma|    214852.0|
| Michael|    214405.0|
|   Ethan|    209277.0|
|Isabella|    204798.0|
+--------+------------+
only showing top 5 rows

In [26]:
df.groupby('Name')['Count'].sum().sort_values().sort_values(ascending=False)

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
             ...
Donoven          5
Aadarsh          5
Hikari           5
Hibba            5
Holten           5
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

## üêç **Soluci√≥n Pyspark**

In [ ]:

totals = (baby_names
          .groupBy('Name')
          .agg(F.sum('Count').alias('total')))
min_total = totals.agg(F.min('total')).first()[0]


totals.filter(F.col('total')==min_total).count()

2578

In [40]:
minimi = df.groupby('Name')['Count'].sum().min()

agrupado =df.groupby('Name', as_index=False)['Count'].sum()

agrupado.loc[agrupado['Count']==5, :].count()

Name     2578
Count    2578
dtype: int64

### Step 11. What is the median name occurrence?

## üêç **Soluci√≥n Pyspark**

In [56]:

medians = (baby_names
           .select('Count')
           .agg(F.expr('percentile_approx(Count, 0.5)').alias('total_median'))
           .orderBy(F.col('total_median').desc()))

median = medians.first()[0]

baby_names.filter(F.col('Count')==median).show()

+---------+----+------+-----+-----+
|     Name|Year|Gender|State|Count|
+---------+----+------+-----+-----+
|  Makayla|2004|     F|   AK|   11|
|    Maria|2004|     F|   AK|   11|
|     Mary|2004|     F|   AK|   11|
| Michelle|2004|     F|   AK|   11|
|Alexandra|2005|     F|   AK|   11|
|   Andrea|2005|     F|   AK|   11|
|   Aubrey|2005|     F|   AK|   11|
|   Aurora|2005|     F|   AK|   11|
|   Autumn|2005|     F|   AK|   11|
|  Bethany|2005|     F|   AK|   11|
|  Jillian|2005|     F|   AK|   11|
|    Julia|2005|     F|   AK|   11|
|  Leilani|2005|     F|   AK|   11|
|    Lydia|2005|     F|   AK|   11|
|    Rylee|2005|     F|   AK|   11|
|     Sara|2005|     F|   AK|   11|
| Serenity|2005|     F|   AK|   11|
|  Vanessa|2005|     F|   AK|   11|
|   Aurora|2006|     F|   AK|   11|
|    Jenna|2006|     F|   AK|   11|
+---------+----+------+-----+-----+
only showing top 20 rows

In [53]:
median = df['Count'].median()

df.loc[df['Count']==median]

                Name  Year Gender State  Count
71           Makayla  2004      F    AK     11
72             Maria  2004      F    AK     11
73              Mary  2004      F    AK     11
74          Michelle  2004      F    AK     11
259        Alexandra  2005      F    AK     11
...              ...   ...    ...   ...    ...
1016276  Christopher  2014      M    WY     11
1016277       Corbin  2014      M    WY     11
1016278        Gavin  2014      M    WY     11
1016279      Greyson  2014      M    WY     11
1016280       Isaiah  2014      M    WY     11

[36199 rows x 5 columns]

### Step 12. What is the standard deviation of names?

## üêç **Soluci√≥n Pyspark**

In [61]:
totals = (baby_names
          .groupBy('Name')
          .agg(F.sum('Count').alias('total')))

std_samp = totals.agg(F.stddev_samp('total')).first()[0]   # equivalente a names.Count.std()
std_samp

11006.069467890562

In [66]:
total = df.groupby('Name')['Count'].sum().to_frame('cuenta')
total['cuenta'].std()

np.float64(11006.06946789057)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

## üêç **Soluci√≥n Pyspark**

In [68]:
totals.describe().show()

+-------+--------+------------------+
|summary|    Name|             total|
+-------+--------+------------------+
|  count|   17632|             17632|
|   mean|Infinity| 2008.932168784029|
| stddev|    NULL|11006.069467890562|
|    min|   Aaban|               5.0|
|    max|  Zyriah|          242874.0|
+-------+--------+------------------+

In [69]:
total.describe()

              cuenta
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000